# Используем официальный образ Python в качестве базового
FROM python:3.11-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы в рабочую директорию /app
COPY . .

# Указываем порт, на котором будет работать приложение внутри контейнера
# Uvicorn по умолчанию запускается на 8000, если не указано иное
EXPOSE 8000

# Команда для запуска приложения при старте контейнера
# --host 0.0.0.0 делает приложение доступным извне контейнера
# --port 8000 указывает порт внутри контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000", "--reload"]